app/controllers/api/v1/plants_controller.rb

  def show
    plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]