app/controllers/api/v1/plants_controller.rb

INSERT INTO "plants" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Orquídea Roxo"], ["description", "Plantinha delicada!"], ["created_at", "2019-12-06 22:41:35.550649"], ["updated_at", "2019-12-06 22:41:35.550649"]]
---
  def create
    plant = Plant.new(plants_params)

    if plant.save

SELECT "plants".* FROM "plants" ORDER BY created_at DESC
---
  def index
    plants = Plant.order('created_at DESC');

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "plants" SET "name" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["name", "Roseira Vermelha"], ["updated_at", "2019-12-06 22:09:45.291746"], ["id", 1]]
---
  def update
    plant = Plant.find(params[:id])

    if plant.update_attributes(plants_params)